Laminar incompressible Flowa/ppWall/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions           [0 1 -1 0 0 0 0];

internalField        uniform (0 0 0);

boundaryField
{
    top
    {
       type              fixedValue;
       value             uniform (1 0 0);
    }

    bottom
    {
       type              fixedValue;
       value             uniform (0 0 0);
    }

    inlet
    {
       type              zeroGradient;
    }

    outlet
    {
       type              zeroGradient;
    }

    frontAndBack
    {
      type               empty;
    }
}


// ************************************************************************* //
