Laminar incompressible Flowa/ppWall/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
   (0 0 0)
   (20 0 0)
   (20 1 0)
   (0 1 0)
   (0 0 0.1)
   (20 0 0.1)
   (20 1 0.1)
   (0 1 0.1)
);

blocks
(
   hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
   top
   {
       type wall;
       faces
       (
            (3 7 6 2)
       );
   }
   bottom
   {
       type wall;
       faces
       (
           (1 5 4 0)
       );
   }
   inlet
   {
       type patch;
       faces
       (
           (0 4 7 3)
       );
   }
   outlet
   {
       type patch;
       faces
       (
           (2 6 5 1)
       );
   }
   frontAndBack
   {
       type empty;
       faces
       (
          (0 3 2 1)
          (4 5 6 7)
       );
   }
);

mergePatchPairs
(
);

// ************************************************************************* //

